// モジュール定義
// FPGA外部との入出力を定義する
module blink (

    // 外部クロック入力
    // 今回は約33 MHzのPLクロックを想定
    input               CLK,

    // リセット入力
    // この基板では active-low
    // つまり:
    //   1 = 通常動作
    //   0 = リセット
    input               RST,

    // 3bitのLED出力
    // [2] = LED3_H18
    // [1] = LED2_K17
    // [0] = LED1_E19
    output  reg [2:0]   LED_RGB
);



// ============================================================
// 24bitカウンタ
// クロック分周用
// ============================================================

// 24bitレジスタ宣言
// reg は「値を保持する回路」を意味する
reg [23:0] cnt24;


// CLK立ち上がり毎に実行
always @(posedge CLK) begin

    // !RST:
    // RST=0 のとき true
    // つまりリセットボタン押下時
    if (!RST)

        // カウンタを0へ戻す
        cnt24 <= 24'h0;

    else

        // 1クロック毎に+1
        cnt24 <= cnt24 + 1'b1;
end



// ============================================================
// カウンタ最大値検出
// ============================================================

// cnt24 が 0xFFFFFF になった瞬間だけ1になる信号
wire ledcnten = (cnt24 == 24'hffffff);



// ============================================================
// LED表示状態カウンタ
// ============================================================

// LED表示パターン番号
// 0〜5 を循環
reg [2:0] cnt3;


// クロック立ち上がり毎
always @(posedge CLK) begin

    // リセット時
    if (!RST)

        // パターン番号を0へ戻す
        cnt3 <= 3'h0;

    // cnt24 が最大値になったタイミングでのみ更新
    else if (ledcnten) begin

        // 最後のパターンなら
        if (cnt3 == 3'd5)

            // 最初へ戻る
            cnt3 <= 3'h0;

        else

            // 次のパターンへ
            cnt3 <= cnt3 + 3'h1;
    end
end



// ============================================================
// LED出力デコーダ
// ============================================================

// combinational logic
// cnt3 の値に応じてLED出力を決定
always @* begin

    // cnt3 の値ごとに分岐
    case (cnt3)

        // 100:
        // LED3のみ点灯
        3'd0:   LED_RGB = 3'b100;

        // LED2のみ点灯
        3'd1:   LED_RGB = 3'b010;

        // LED3 + LED2 点灯
        3'd2:   LED_RGB = 3'b110;

        // LED2のみ点灯
        3'd3:   LED_RGB = 3'b010;

        // LED3のみ点灯
        3'd4:   LED_RGB = 3'b100;

        // 全消灯
        3'd5:   LED_RGB = 3'b000;

        // 念のためのデフォルト
        default:LED_RGB = 3'b000;
    endcase
end

endmodule